text = "Еу, бро!"
print(text)
print(text.upper())
print(text.lower())
print(text.title())
print(text.replace("Еу", "Пока"))
print(text.swapcase())

print("Game", end=" ")
print("over")

print("""
  ***     **    **  **  ******
 *       *  *   * ** *  *
 * ***  *    *  *  * *  *****
 *   *  ******  *    *  *
  ***   *    *  *    *  ******

  ***   *    *  ******  ****
 *   *  *    *  *       *   *
 *   *  *    *  *****   ****
 *   *   *  *   *       *   *
  ***     **    ******  *   *
""")

text = "Бородино"
print("\t" * 8, text.upper(), "\n\n")
print("\t" * 6, "— Скажи-ка, дядя," + " ведь не даром\n", "\t" * 6, "Москва, спаленная пожаром,\n", "\t" * 7, \
      "Французу" + " отдана?")
print("\t" * 6, "Ведь были ж схватки боевые,\n", "\t" * 6, "Да, говорят, еще какие!")
print("\t" * 6, "Недаром помнит вся Россия,\n", "\t" * 7, "Про день Бородина!\n")
print("\t" * 6, "— Да, были люди" + " в наше время,\n", "\t" * 6, "Не то," + " что" + " нынешнее племя:\n", \
      "\t" * 7, "Богатыри — не вы!")
print("\t" * 6, "Плохая им досталась доля:\n", "\t" * 6, "Немногие вернулись с поля...")
print("\t" * 6, "Не будь на то господня воля,\n", "\t" * 7, "Не" + " отдали" + " б" + " Москвы!\n")
print("\t" * 6, "Мы долго молча отступали,\n", "\t" * 6, "Досадно было, боя ждали,\n", "\t" * 7, "Ворчали" + " старики:")
print("\t" * 6, "«Что ж мы?" + " на зимние квартиры?\n", "\t" * 6, "Не смеют, что ли, командиры")
print("\t" * 6, "Чужие изорвать мундиры,\n", "\t" * 7, "О русские штыки?»\n")

input("Press Enter to continue...")
