# 2. Напишите функции конвертации градусов Цельсия и Фаренгейта.
def convert(t):
    print("Po Farengejtu:", (t * 1.8 + 32))

convert(int(input("Kakaja temperatura segodnja(C): ")))