# Дано натуральное число. Выведите его последнюю цифру.

number = int(input("Enter a number: "))
print("Last numeral:", number % 10)