/* Задание 1: Напишите программу, которая создает двухмерный массив и заполняет его по
   следующему принципу : пользователь вводит число(например, 3) первый элемент массива
   принимает значение этого числа, последующий элемент массива принимает значение
   этого числа умноженного на 2 (т.е. 6 для нашего примера), третий элемент массива
   предыдущий элемент умноженный на 2 (т.е. 6 * 2 = 12 для нашего примера).Созданный
   массив вывести на экран. */

#include <stdio.h>

int main()
{

	return 0;
}